In [4]:
#Obtener la diferencia entre el salario más alto y el más bajo.
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    "Nombre":["Miguel","Luis","Eduardo","Jorge","Lorena","Lizbeth","Karla","Yadira"],
    "Edad" : [28,25,29,29,21,23,29,24],
    "Salario": [13000,10000,21000,14500,12000,29000,16000,5000],
    "Genero": ["M","M","M","M","F","F","F","F"]
}
data=pd.DataFrame(dict1)

In [6]:
data

    Nombre  Edad  Salario Genero
0   Miguel    28    13000      M
1     Luis    25    10000      M
2  Eduardo    29    21000      M
3    Jorge    29    14500      M
4   Lorena    21    12000      F
5  Lizbeth    23    29000      F
6    Karla    29    16000      F
7   Yadira    24     5000      F

In [7]:
salarioMinimo = data["Salario"].min()
salarioMinimo

5000

In [8]:
salarioMaximo = data["Salario"].max()
salarioMaximo

29000

In [9]:
difSalario = salarioMaximo - salarioMinimo
difSalario

24000

In [10]:
#Obtener los estadísticos descriptivos de los salarios. (media, mediana, desviación estándar, etc..
data.describe()

            Edad       Salario
count   8.000000      8.000000
mean   26.000000  15062.500000
std     3.162278   7282.255832
min    21.000000   5000.000000
25%    23.750000  11500.000000
50%    26.500000  13750.000000
75%    29.000000  17250.000000
max    29.000000  29000.000000

In [11]:
data["Salario"].describe()

count        8.000000
mean     15062.500000
std       7282.255832
min       5000.000000
25%      11500.000000
50%      13750.000000
75%      17250.000000
max      29000.000000
Name: Salario, dtype: float64

In [12]:
#Media de Salario
data["Salario"].mean()

15062.5

In [13]:
#Mediana de Salario
data["Salario"].median()

13750.0

In [14]:
#Desviación estandar de salario
data["Salario"].std()

7282.255831814754

In [15]:
#Suma cumulativa de salario
data["Salario"].cumsum()

0     13000
1     23000
2     44000
3     58500
4     70500
5     99500
6    115500
7    120500
Name: Salario, dtype: int64